<?PHP
//장르 넘버를 부여하는 코드
function genreNum5($g1, $g2, $g3 , $g4, $g5){
    $n=0;
    if($g1=="액션 영화"||$g1=="액션"||$g1=="액션 스릴러"||$g1=="액션어드벤처"||$g1=="무협 영화"){
        $n = $n|pow(2,0);
    }
    if($g1 == "스릴러"||$g1=="액션 스릴러"||$g1=="심리스릴러"||$g1=="하이스트 영화"||$g1=="심리호러"||$g1=="슬래셔 영화"||$g1=="애로틱 스릴러"||$g1=="정치 스릴러"||$g1=="서스펜스"){
        $n = $n|pow(2,1);
    }
    if($g1 =="드라마"||$g1=="역사 드라마"||$g1=="코미디 드라마"||$g1=="음악 드라마"||$g1=="버디 영화"||$g1=="멜로드라마"||$g1=="정치 드라마"||$g1=="다큐드라마"||$g1=="법정드라마"||$g1=="성장 스토리"||$g1=="전기"||$g1=="Survival film"){
        $n = $n|pow(2,2);
    }
    if($g1 == "전쟁 영화"){
        $n = $n|pow(2,3);
    }
    if($g1 == "첩보영화"){
        $n = $n|pow(2,4);
    }
    if($g1 == "모험 영화"||$g1=="액션어드벤처"||$g1=="Survival film"){
        $n = $n|pow(2,5);
    }
    if($g1 == "역사"||$g1=="서사 영화"||$g1=="역사허구물"||$g1=="역사 드라마"||$g1=="시대물"||$g1=="역사 로맨스"||$g1=="사극"||$g1=="무협 영화"){
        $n = $n|pow(2,6);
    }
    if($g1 == "서부극"||$g1=="스파게티 웨스턴"){
        $n = $n|pow(2,7);
    }
    if($g1 == "판타지 영화"||$g1=="판타지"){
        $n = $n|pow(2,8);
    }
    if($g1 == "풍자"||$g1=="풍습희극"||$g1=="풍속소설"){
        $n = $n|pow(2,9);
    }
    if($g1 == "코미디 영화"||$g1=="코미디 드라마"||$g1=="코미디"||$g1=="뮤지컬 코미디"||$g1=="로맨틱 코미디"||$g1=="블랙 코미디"||$g1=="풍습희극"||$g1=="호러 코미디"||$g1=="뮤지컬 코미디"||$g1=="패러디"||$g1=="희극"||$g1=="스크루볼 코미디"){
        $n = $n|pow(2,10);
    }
    if($g1 == "로맨스"||$g1=="로맨틱 코미디"||$g1=="멜로/로맨스"||$g1=="연애 소설"||$g1=="역사 로맨스"){
        $n = $n|pow(2,11);
    }
    if($g1 == "가족 영화"||$g1=="가족"){
        $n = $n|pow(2,12);
    }
    if($g1 == "음악 드라마"||$g1=="음악 장르"||$g1=="음악"||$g1=="콘서트 영화"){
        $n = $n|pow(2,13);
    }
    if($g1 == "뮤지컬 코미디"||$g1=="백스테이지 뮤지컬"||$g1=="뮤지컬 코미디"){
        $n = $n|pow(2,14);
    }
    if($g1 == "범죄 영화"||$g1=="하이스트 영화"||$g1=="범죄물"||$g1=="슬래셔 영화"||$g1=="스플래터 영화"||$g1=="범죄 다큐멘터리"||$g1=="추리물"||$g1=="범죄"){
        $n = $n|pow(2,15);
    }
    if($g1 ==  "미스터리 영화"||$g1=="미스터리"||$g1=="심리호러"||$g1=="추리물"){
        $n = $n|pow(2,16);
    }
    if($g1 == "멜로드라마"||$g1=="멜로드라마"||$g1=="멜로/로맨스"||$g1=="멜로드라마"){
        $n = $n|pow(2,17);
    }
    if($g1 == "애니매이션"||$g1=="일본의 애니메이션"||$g1 == "애니메이션"){
        $n = $n|pow(2,18);
    }
    if($g1 == "SF 영화"||$g1=="공상 과학"||$g1=="포스트 아포칼립스픽션"||$g1=="픽션"||$g1=="스팀펑크"){
        $n = $n|pow(2,19);
    }
    if($g1 == "종교 영화"||$g1 =="알레고리"){
        $n = $n|pow(2,20);
    }
    if($g1 == "공포 영화"||$g1=="호러 코미디"||$g1=="심리호러"||$g1=="슬래셔 영화"||$g1=="스플래터 영화"||$g1=="괴수 영화"||$g1=="심리호러"||$g1=="공포(호러)"){
        $n = $n|pow(2,21);
    }
    if($g1 == "댄스영화"){
        $n = $n|pow(2,22);
    }
    if($g1 == "슈퍼히어로영화"){
        $n = $n|pow(2,23);
    }
    if($g1 == "스포츠"){
        $n = $n|pow(2,24);
    }
    if($g1 == "에로티카"||$g1=="에로틱 스틸러"||$g1=="애로틱 스릴러"){
        $n = $n|pow(2,25);
    }
    if($g1 == "필름 누아르"){
        $n = $n|pow(2,26);
    }
    if($g1 == "초자연적 현상"||$g1=="포스트 아포칼립스픽션"||$g1=="재난 영화"||$g1=="괴수 영화"||$g1=="Survival film"){
        $n = $n|pow(2,27);
    }
    if($g1 == "정치 스릴러"||$g1=="정치 드라마"){
        $n = $n|pow(2,28);
    }
    if($g1 == "다큐드라마"||$g1=="범죄 다큐멘터리"||$g1=="Nature documentary"||$g1=="성장 스토리"||$g1 == "다큐멘터리"){
        $n = $n|pow(2,29);
    }
    if($g1 == "법정드라마"){
        $n = $n|pow(2,30);
    }



    if($g2=="액션 영화"||$g2=="액션"||$g2=="액션 스릴러"||$g2=="액션어드벤처"||$g2=="무협 영화"){
        $n = $n|pow(2,0);
    }
    if($g2 == "스릴러"||$g2=="액션 스릴러"||$g2=="심리스릴러"||$g2=="하이스트 영화"||$g2=="심리호러"||$g2=="슬래셔 영화"||$g2=="애로틱 스릴러"||$g2=="정치 스릴러"||$g2=="서스펜스"){
        $n = $n|pow(2,1);
    }
    if($g2 =="드라마"||$g2=="역사 드라마"||$g2=="코미디 드라마"||$g2=="음악 드라마"||$g2=="버디 영화"||$g2=="멜로드라마"||$g2=="정치 드라마"||$g2=="다큐드라마"||$g2=="법정드라마"||$g2=="성장 스토리"||$g2=="전기"||$g2=="Survival film"){
        $n = $n|pow(2,2);
    }
    if($g2 == "전쟁 영화"){
        $n = $n|pow(2,3);
    }
    if($g2 == "첩보영화"){
        $n = $n|pow(2,4);
    }
    if($g2 == "모험 영화"||$g2=="액션어드벤처"||$g2=="Survival film"){
        $n = $n|pow(2,5);
    }
    if($g2 == "역사"||$g2=="서사 영화"||$g2=="역사허구물"||$g2=="역사 드라마"||$g2=="시대물"||$g2=="역사 로맨스"||$g2=="사극"||$g2=="무협 영화"){
        $n = $n|pow(2,6);
    }
    if($g2 == "서부극"||$g2=="스파게티 웨스턴"){
        $n = $n|pow(2,7);
    }
    if($g2 == "판타지 영화"||$g2=="판타지"){
        $n = $n|pow(2,8);
    }
    if($g2 == "풍자"||$g2=="풍습희극"||$g2=="풍속소설"){
        $n = $n|pow(2,9);
    }
    if($g2 == "코미디 영화"||$g2=="코미디 드라마"||$g2=="코미디"||$g2=="뮤지컬 코미디"||$g2=="로맨틱 코미디"||$g2=="블랙 코미디"||$g2=="풍습희극"||$g2=="호러 코미디"||$g2=="뮤지컬 코미디"||$g2=="패러디"||$g2=="희극"||$g2=="스크루볼 코미디"){
        $n = $n|pow(2,10);
    }
    if($g2 == "로맨스"||$g2=="로맨틱 코미디"||$g2=="멜로/로맨스"||$g2=="연애 소설"||$g2=="역사 로맨스"){
        $n = $n|pow(2,11);
    }
    if($g2 == "가족 영화"||$g2=="가족"){
        $n = $n|pow(2,12);
    }
    if($g2 == "음악 드라마"||$g2=="음악 장르"||$g2=="음악"||$g2=="콘서트 영화"){
        $n = $n|pow(2,13);
    }
    if($g2 == "뮤지컬 코미디"||$g2=="백스테이지 뮤지컬"||$g2=="뮤지컬 코미디"){
        $n = $n|pow(2,14);
    }
    if($g2 == "범죄 영화"||$g2=="하이스트 영화"||$g2=="범죄물"||$g2=="슬래셔 영화"||$g2=="스플래터 영화"||$g2=="범죄 다큐멘터리"||$g2=="추리물"||$g2=="범죄"){
        $n = $n|pow(2,15);
    }
    if($g2 ==  "미스터리 영화"||$g2=="미스터리"||$g2=="심리호러"||$g2=="추리물"){
        $n = $n|pow(2,16);
    }
    if($g2 == "멜로드라마"||$g2=="멜로드라마"||$g2=="멜로/로맨스"||$g2=="멜로드라마"){
        $n = $n|pow(2,17);
    }
    if($g2 == "애니매이션"||$g2=="일본의 애니메이션"||$g2 == "애니메이션"){
        $n = $n|pow(2,18);
    }
    if($g2 == "SF 영화"||$g2=="공상 과학"||$g2=="포스트 아포칼립스픽션"||$g2=="픽션"||$g2=="스팀펑크"){
        $n = $n|pow(2,19);
    }
    if($g2 == "종교 영화"||$g2=="알레고리"){
        $n = $n|pow(2,20);
    }
    if($g2 == "공포 영화"||$g2=="호러 코미디"||$g2=="심리호러"||$g2=="슬래셔 영화"||$g2=="스플래터 영화"||$g2=="괴수 영화"||$g2=="심리호러"||$g2=="공포(호러)"){
        $n = $n|pow(2,21);
    }
    if($g2 == "댄스영화"){
        $n = $n|pow(2,22);
    }
    if($g2 == "슈퍼히어로영화"){
        $n = $n|pow(2,23);
    }
    if($g2 == "스포츠"){
        $n = $n|pow(2,24);
    }
    if($g2 == "에로티카"||$g2=="에로틱 스틸러"||$g2=="애로틱 스릴러"){
        $n = $n|pow(2,25);
    }
    if($g2 == "필름 누아르"){
        $n = $n|pow(2,26);
    }
    if($g2 == "초자연적 현상"||$g2=="포스트 아포칼립스픽션"||$g2=="재난 영화"||$g2=="괴수 영화"||$g2=="Survival film"){
        $n = $n|pow(2,27);
    }
    if($g2 == "정치 스릴러"||$g2=="정치 드라마"){
        $n = $n|pow(2,28);
    }
    if($g2 == "다큐드라마"||$g2=="범죄 다큐멘터리"||$g2=="Nature documentary"||$g2=="성장 스토리"||$g2 == "다큐멘터리"){
        $n = $n|pow(2,29);
    }
    if($g2 == "법정드라마"){
        $n = $n|pow(2,30);
    }


    if($g3=="액션 영화"||$g3=="액션"||$g3=="액션 스릴러"||$g3=="액션어드벤처"||$g3=="무협 영화"){
        $n = $n|pow(2,0);
    }
    if($g3 == "스릴러"||$g3=="액션 스릴러"||$g3=="심리스릴러"||$g3=="하이스트 영화"||$g3=="심리호러"||"슬래셔 영화"||$g3=="애로틱 스릴러"||$g3=="정치 스릴러"||$g3=="서스펜스"){
        $n = $n|pow(2,1);
    }
    if($g3 =="드라마"||$g3=="역사 드라마"||$g3=="코미디 드라마"||$g3=="음악 드라마"||$g3=="버디 영화"||$g3=="멜로드라마"||$g3=="정치 드라마"||$g3=="다큐드라마"||$g3=="법정드라마"||$g3=="성장 스토리"||$g3=="전기"||$g3=="Survival film"){
        $n = $n|pow(2,2);
    }
    if($g3 == "전쟁 영화"){
        $n = $n|pow(2,3);
    }
    if($g3 == "첩보영화"){
        $n = $n|pow(2,4);
    }
    if($g3 == "모험 영화"||$g3=="액션어드벤처"||$g3=="Survival film"){
        $n = $n|pow(2,5);
    }
    if($g3 == "역사"||$g3=="서사 영화"||$g3=="역사허구물"||$g3=="역사 드라마"||$g3=="시대물"||$g3=="역사 로맨스"||$g3=="사극"||$g3=="무협 영화"){
        $n = $n|pow(2,6);
    }
    if($g3 == "서부극"||$g3=="스파게티 웨스턴"){
        $n = $n|pow(2,7);
    }
    if($g3 == "판타지 영화"||$g3=="판타지"){
        $n = $n|pow(2,8);
    }
    if($g3 == "풍자"||$g3=="풍습희극"||$g3=="풍속소설"){
        $n = $n|pow(2,9);
    }
    if($g3 == "코미디 영화"||$g3=="코미디 드라마"||$g3=="코미디"||$g3=="뮤지컬 코미디"||$g3=="로맨틱 코미디"||$g3=="블랙 코미디"||$g3=="풍습희극"||$g3=="호러 코미디"||$g3=="뮤지컬 코미디"||$g3=="패러디"||$g3=="희극"||$g3=="스크루볼 코미디"){
        $n = $n|pow(2,10);
    }
    if($g3 == "로맨스"||$g3=="로맨틱 코미디"||$g3=="멜로/로맨스"||$g3=="연애 소설"||$g3=="역사 로맨스"){
        $n = $n|pow(2,11);
    }
    if($g3 == "가족 영화"||$g3=="가족"){
        $n = $n|pow(2,12);
    }
    if($g3 == "음악 드라마"||$g3=="음악 장르"||$g3=="음악"||$g3=="콘서트 영화"){
        $n = $n|pow(2,13);
    }
    if($g3 == "뮤지컬 코미디"||$g3=="백스테이지 뮤지컬"||$g3=="뮤지컬 코미디"){
        $n = $n|pow(2,14);
    }
    if($g3 == "범죄 영화"||$g3=="하이스트 영화"||$g3=="범죄물"||$g3=="슬래셔 영화"||$g3=="스플래터 영화"||$g3=="범죄 다큐멘터리"||$g3=="추리물"||$g3=="범죄"){
        $n = $n|pow(2,15);
    }
    if($g3 ==  "미스터리 영화"||$g3=="미스터리"||$g3=="심리호러"||$g3=="추리물"){
        $n = $n|pow(2,16);
    }
    if($g3 == "멜로드라마"||$g3=="멜로드라마"||$g3=="멜로/로맨스"||$g3=="멜로드라마"){
        $n = $n|pow(2,17);
    }
    if($g3 == "애니매이션"||$g3=="일본의 애니메이션"||$g3 == "애니메이션"){
        $n = $n|pow(2,18);
    }
    if($g3 == "SF 영화"||$g3=="공상 과학"||$g3=="포스트 아포칼립스픽션"||$g3=="픽션"||$g3=="스팀펑크"){
        $n = $n|pow(2,19);
    }
    if($g3 == "종교 영화"||$g3=="알레고리"){
        $n = $n|pow(2,20);
    }
    if($g3 == "공포 영화"||$g3=="호러 코미디"||$g3=="심리호러"||$g3=="슬래셔 영화"||$g3=="스플래터 영화"||$g3=="괴수 영화"||$g3=="심리호러"||$g3=="공포(호러)"){
        $n = $n|pow(2,21);
    }
    if($g3 == "댄스영화"){
        $n = $n|pow(2,22);
    }
    if($g3 == "슈퍼히어로영화"){
        $n = $n|pow(2,23);
    }
    if($g3 == "스포츠"){
        $n = $n|pow(2,24);
    }
    if($g3 == "에로티카"||$g3=="에로틱 스틸러"||$g3=="애로틱 스릴러"){
        $n = $n|pow(2,25);
    }
    if($g3 == "필름 누아르"){
        $n = $n|pow(2,26);
    }
    if($g3 == "초자연적 현상"||$g3=="포스트 아포칼립스픽션"||$g3=="재난 영화"||$g3=="괴수 영화"||$g3=="Survival film"){
        $n = $n|pow(2,27);
    }
    if($g3 == "정치 스릴러"||$g3=="정치 드라마"){
        $n = $n|pow(2,28);
    }
    if($g3 == "다큐드라마"||$g3=="범죄 다큐멘터리"||$g3=="Nature documentary"||$g3=="성장 스토리"||$g3 == "다큐멘터리"){
        $n = $n|pow(2,29);
    }
    if($g3 == "법정드라마"){
        $n = $n|pow(2,30);
    }



    if($g4=="액션 영화"||$g4=="액션"||$g4=="액션 스릴러"||$g4=="액션어드벤처"||$g4=="무협 영화"){
        $n = $n|pow(2,0);
    }
    if($g4 == "스릴러"||$g4=="액션 스릴러"||$g4=="심리스릴러"||$g4=="하이스트 영화"||$g4=="심리호러"||$g4=="슬래셔 영화"||$g4=="애로틱 스릴러"||$g4=="정치 스릴러"||$g4=="서스펜스"){
        $n = $n|pow(2,1);
    }
    if($g4 =="드라마"||$g4=="역사 드라마"||$g4=="코미디 드라마"||$g4=="음악 드라마"||$g4=="버디 영화"||$g4=="멜로드라마"||$g4=="정치 드라마"||$g4=="다큐드라마"||$g4=="법정드라마"||$g4=="성장 스토리"||$g4=="전기"||$g4=="Survival film"){
        $n = $n|pow(2,2);
    }
    if($g4 == "전쟁 영화"){
        $n = $n|pow(2,3);
    }
    if($g4 == "첩보영화"){
        $n = $n|pow(2,4);
    }
    if($g4 == "모험 영화"||$g4=="액션어드벤처"||$g4=="Survival film"){
        $n = $n|pow(2,5);
    }
    if($g4 == "역사"||$g4=="서사 영화"||$g4=="역사허구물"||$g4=="역사 드라마"||$g4=="시대물"||$g4=="역사 로맨스"||$g4=="사극"||$g4=="무협 영화"){
        $n = $n|pow(2,6);
    }
    if($g4 == "서부극"||$g4=="스파게티 웨스턴"){
        $n = $n|pow(2,7);
    }
    if($g4 == "판타지 영화"||$g4=="판타지"){
        $n = $n|pow(2,8);
    }
    if($g4 == "풍자"||$g4=="풍습희극"||$g4=="풍속소설"){
        $n = $n|pow(2,9);
    }
    if($g4 == "코미디 영화"||$g4=="코미디 드라마"||$g4=="코미디"||$g4=="뮤지컬 코미디"||$g4=="로맨틱 코미디"||$g4=="블랙 코미디"||$g4=="풍습희극"||$g4=="호러 코미디"||$g4=="뮤지컬 코미디"||$g4=="패러디"||$g4=="희극"||$g4=="스크루볼 코미디"){
        $n = $n|pow(2,10);
    }
    if($g4 == "로맨스"||$g4=="로맨틱 코미디"||$g4=="멜로/로맨스"||$g4=="연애 소설"||$g4=="역사 로맨스"){
        $n = $n|pow(2,11);
    }
    if($g4 == "가족 영화"||$g4=="가족"){
        $n = $n|pow(2,12);
    }
    if($g4 == "음악 드라마"||$g4=="음악 장르"||$g4=="음악"||$g4=="콘서트 영화"){
        $n = $n|pow(2,13);
    }
    if($g4 == "뮤지컬 코미디"||$g4=="백스테이지 뮤지컬"||$g4=="뮤지컬 코미디"){
        $n = $n|pow(2,14);
    }
    if($g4 == "범죄 영화"||$g4=="하이스트 영화"||$g4=="범죄물"||$g4=="슬래셔 영화"||$g4=="스플래터 영화"||$g4=="범죄 다큐멘터리"||$g4=="추리물"||$g4=="범죄"){
        $n = $n|pow(2,15);
    }
    if($g4 ==  "미스터리 영화"||$g4=="미스터리"||$g4=="심리호러"||$g4=="추리물"){
        $n = $n|pow(2,16);
    }
    if($g4 == "멜로드라마"||$g4=="멜로드라마"||$g4=="멜로/로맨스"||$g4=="멜로드라마"){
        $n = $n|pow(2,17);
    }
    if($g4 == "애니매이션"||$g4=="일본의 애니메이션"||$g4 == "애니메이션"){
        $n = $n|pow(2,18);
    }
    if($g4 == "SF 영화"||$g4=="공상 과학"||$g4=="포스트 아포칼립스픽션"||$g4=="픽션"||$g4=="스팀펑크"){
        $n = $n|pow(2,19);
    }
    if($g4 == "종교 영화"||$g4=="알레고리"){
        $n = $n|pow(2,20);
    }
    if($g4 == "공포 영화"||$g4=="호러 코미디"||$g4=="심리호러"||$g4=="슬래셔 영화"||$g4=="스플래터 영화"||$g4=="괴수 영화"||$g4=="심리호러"||$g4=="공포(호러)"){
        $n = $n|pow(2,21);
    }
    if($g4 == "댄스영화"){
        $n = $n|pow(2,22);
    }
    if($g4 == "슈퍼히어로영화"){
        $n = $n|pow(2,23);
    }
    if($g4 == "스포츠"){
        $n = $n|pow(2,24);
    }
    if($g4 == "에로티카"||$g4=="에로틱 스틸러"||$g4=="애로틱 스릴러"){
        $n = $n|pow(2,25);
    }
    if($g4 == "필름 누아르"){
        $n = $n|pow(2,26);
    }
    if($g4 == "초자연적 현상"||$g4=="포스트 아포칼립스픽션"||$g4=="재난 영화"||$g4=="괴수 영화"||$g4=="Survival film"){
        $n = $n|pow(2,27);
    }
    if($g4 == "정치 스릴러"||$g4=="정치 드라마"){
        $n = $n|pow(2,28);
    }
    if($g4 == "다큐드라마"||$g4=="범죄 다큐멘터리"||$g4=="Nature documentary"||$g4=="성장 스토리"||$g4 == "다큐멘터리"){
        $n = $n|pow(2,29);
    }
    if($g4 == "법정드라마"){
        $n = $n|pow(2,30);
    }




    if($g5=="액션 영화"||$g5=="액션"||$g5=="액션 스릴러"||$g5=="액션어드벤처"||$g5=="무협 영화"){
        $n = $n|pow(2,0);
    }
    if($g5 == "스릴러"||$g5=="액션 스릴러"||$g5=="심리스릴러"||$g5=="하이스트 영화"||$g5=="심리호러"||$g5=="슬래셔 영화"||$g5=="애로틱 스릴러"||$g5=="정치 스릴러"||$g5=="서스펜스"){
        $n = $n|pow(2,1);
    }
    if($g5 =="드라마"||$g5=="역사 드라마"||$g5=="코미디 드라마"||$g5=="음악 드라마"||$g5=="버디 영화"||$g5=="멜로드라마"||$g5=="정치 드라마"||$g5=="다큐드라마"||$g5=="법정드라마"||$g5=="성장 스토리"||$g5=="전기"||$g5=="Survival film"){
        $n = $n|pow(2,2);
    }
    if($g5 == "전쟁 영화"){
        $n = $n|pow(2,3);
    }
    if($g5 == "첩보영화"){
        $n = $n|pow(2,4);
    }
    if($g5 == "모험 영화"||$g5=="액션어드벤처"||$g5=="Survival film"){
        $n = $n|pow(2,5);
    }
    if($g5 == "역사"||$g5=="서사 영화"||$g5=="역사허구물"||$g5=="역사 드라마"||$g5=="시대물"||$g5=="역사 로맨스"||$g5=="사극"||$g5=="무협 영화"){
        $n = $n|pow(2,6);
    }
    if($g5 == "서부극"||$g5=="스파게티 웨스턴"){
        $n = $n|pow(2,7);
    }
    if($g5 == "판타지 영화"||$g5=="판타지"){
        $n = $n|pow(2,8);
    }
    if($g5 == "풍자"||$g5=="풍습희극"||$g5=="풍속소설"){
        $n = $n|pow(2,9);
    }
    if($g5 == "코미디 영화"||$g5=="코미디 드라마"||$g5=="코미디"||$g5=="뮤지컬 코미디"||$g5=="로맨틱 코미디"||$g5=="블랙 코미디"||$g5=="풍습희극"||$g5=="호러 코미디"||$g5=="뮤지컬 코미디"||$g5=="패러디"||$g5=="희극"||$g5=="스크루볼 코미디"){
        $n = $n|pow(2,10);
    }
    if($g5 == "로맨스"||$g5=="로맨틱 코미디"||$g5=="멜로/로맨스"||$g5=="연애 소설"||$g5=="역사 로맨스"){
        $n = $n|pow(2,11);
    }
    if($g5 == "가족 영화"||$g5=="가족"){
        $n = $n|pow(2,12);
    }
    if($g5 == "음악 드라마"||$g5=="음악 장르"||$g5=="음악"||$g5=="콘서트 영화"){
        $n = $n|pow(2,13);
    }
    if($g5 == "뮤지컬 코미디"||$g5=="백스테이지 뮤지컬"||$g5=="뮤지컬 코미디"){
        $n = $n|pow(2,14);
    }
    if($g5 == "범죄 영화"||$g5=="하이스트 영화"||$g5=="범죄물"||$g5=="슬래셔 영화"||$g5=="스플래터 영화"||$g5=="범죄 다큐멘터리"||$g5=="추리물"||$g5=="범죄"){
        $n = $n|pow(2,15);
    }
    if($g5 ==  "미스터리 영화"||$g5=="미스터리"||$g5=="심리호러"||$g5=="추리물"){
        $n = $n|pow(2,16);
    }
    if($g5 == "멜로드라마"||$g5=="멜로드라마"||$g5=="멜로/로맨스"||$g5=="멜로드라마"){
        $n = $n|pow(2,17);
    }
    if($g5 == "애니매이션"||$g5=="일본의 애니메이션"||$g5 == "애니메이션"){
        $n = $n|pow(2,18);
    }
    if($g5 == "SF 영화"||$g5=="공상 과학"||$g5=="포스트 아포칼립스픽션"||$g5=="픽션"||$g5=="스팀펑크"){
        $n = $n|pow(2,19);
    }
    if($g5 == "종교 영화"||$g5=="알레고리"){
        $n = $n|pow(2,20);
    }
    if($g5 == "공포 영화"||$g5=="호러 코미디"||$g5=="심리호러"||$g5=="슬래셔 영화"||$g5=="스플래터 영화"||$g5=="괴수 영화"||$g5=="심리호러"||$g5=="공포(호러)"){
        $n = $n|pow(2,21);
    }
    if($g5 == "댄스영화"){
        $n = $n|pow(2,22);
    }
    if($g5 == "슈퍼히어로영화"){
        $n = $n|pow(2,23);
    }
    if($g5 == "스포츠"){
        $n = $n|pow(2,24);
    }
    if($g5 == "에로티카"||$g5=="에로틱 스틸러"||$g5=="애로틱 스릴러"){
        $n = $n|pow(2,25);
    }
    if($g5 == "필름 누아르"){
        $n = $n|pow(2,26);
    }
    if($g5 == "초자연적 현상"||$g5=="포스트 아포칼립스픽션"||$g5=="재난 영화"||$g5=="괴수 영화"||$g5=="Survival film"){
        $n = $n|pow(2,27);
    }
    if($g5 == "정치 스릴러"||$g5=="정치 드라마"){
        $n = $n|pow(2,28);
    }
    if($g5 == "다큐드라마"||$g5=="범죄 다큐멘터리"||$g5=="Nature documentary"||$g5=="성장 스토리"||$g5 == "다큐멘터리"){
        $n = $n|pow(2,29);
    }
    if($g5 == "법정드라마"){
        $n = $n|pow(2,30);
    }


    return $n;

}
function genreNum4($g1, $g2, $g3 , $g4){
    $n=0;
    if($g1=="액션 영화"||$g1=="액션"||$g1=="액션 스릴러"||$g1=="액션어드벤처"||$g1=="무협 영화"){
        $n = $n|pow(2,0);
    }
    if($g1 == "스릴러"||$g1=="액션 스릴러"||$g1=="심리스릴러"||$g1=="하이스트 영화"||$g1=="심리호러"||$g1=="슬래셔 영화"||$g1=="애로틱 스릴러"||$g1=="정치 스릴러"||$g1=="서스펜스"){
        $n = $n|pow(2,1);
    }
    if($g1 =="드라마"||$g1=="역사 드라마"||$g1=="코미디 드라마"||$g1=="음악 드라마"||$g1=="버디 영화"||$g1=="멜로드라마"||$g1=="정치 드라마"||$g1=="다큐드라마"||$g1=="법정드라마"||$g1=="성장 스토리"||$g1=="전기"||$g1=="Survival film"){
        $n = $n|pow(2,2);
    }
    if($g1 == "전쟁 영화"){
        $n = $n|pow(2,3);
    }
    if($g1 == "첩보영화"){
        $n = $n|pow(2,4);
    }
    if($g1 == "모험 영화"||$g1=="액션어드벤처"||$g1=="Survival film"){
        $n = $n|pow(2,5);
    }
    if($g1 == "역사"||$g1=="서사 영화"||$g1=="역사허구물"||$g1=="역사 드라마"||$g1=="시대물"||$g1=="역사 로맨스"||$g1=="사극"||$g1=="무협 영화"){
        $n = $n|pow(2,6);
    }
    if($g1 == "서부극"||$g1=="스파게티 웨스턴"){
        $n = $n|pow(2,7);
    }
    if($g1 == "판타지 영화"||$g1=="판타지"){
        $n = $n|pow(2,8);
    }
    if($g1 == "풍자"||$g1=="풍습희극"||$g1=="풍속소설"){
        $n = $n|pow(2,9);
    }
    if($g1 == "코미디 영화"||$g1=="코미디 드라마"||$g1=="코미디"||$g1=="뮤지컬 코미디"||$g1=="로맨틱 코미디"||$g1=="블랙 코미디"||$g1=="풍습희극"||$g1=="호러 코미디"||$g1=="뮤지컬 코미디"||$g1=="패러디"||$g1=="희극"||$g1=="스크루볼 코미디"){
        $n = $n|pow(2,10);
    }
    if($g1 == "로맨스"||$g1=="로맨틱 코미디"||$g1=="멜로/로맨스"||$g1=="연애 소설"||$g1=="역사 로맨스"){
        $n = $n|pow(2,11);
    }
    if($g1 == "가족 영화"||$g1=="가족"){
        $n = $n|pow(2,12);
    }
    if($g1 == "음악 드라마"||$g1=="음악 장르"||$g1=="음악"||$g1=="콘서트 영화"){
        $n = $n|pow(2,13);
    }
    if($g1 == "뮤지컬 코미디"||$g1=="백스테이지 뮤지컬"||$g1=="뮤지컬 코미디"){
        $n = $n|pow(2,14);
    }
    if($g1 == "범죄 영화"||$g1=="하이스트 영화"||$g1=="범죄물"||$g1=="슬래셔 영화"||$g1=="스플래터 영화"||$g1=="범죄 다큐멘터리"||$g1=="추리물"||$g1=="범죄"){
        $n = $n|pow(2,15);
    }
    if($g1 ==  "미스터리 영화"||$g1=="미스터리"||$g1=="심리호러"||$g1=="추리물"){
        $n = $n|pow(2,16);
    }
    if($g1 == "멜로드라마"||$g1=="멜로드라마"||$g1=="멜로/로맨스"||$g1=="멜로드라마"){
        $n = $n|pow(2,17);
    }
    if($g1 == "애니매이션"||$g1=="일본의 애니메이션"||$g1 == "애니메이션"){
        $n = $n|pow(2,18);
    }
    if($g1 == "SF 영화"||$g1=="공상 과학"||$g1=="포스트 아포칼립스픽션"||$g1=="픽션"||$g1=="스팀펑크"){
        $n = $n|pow(2,19);
    }
    if($g1 == "종교 영화"||$g1 =="알레고리"){
        $n = $n|pow(2,20);
    }
    if($g1 == "공포 영화"||$g1=="호러 코미디"||$g1=="심리호러"||$g1=="슬래셔 영화"||$g1=="스플래터 영화"||$g1=="괴수 영화"||$g1=="심리호러"||$g1=="공포(호러)"){
        $n = $n|pow(2,21);
    }
    if($g1 == "댄스영화"){
        $n = $n|pow(2,22);
    }
    if($g1 == "슈퍼히어로영화"){
        $n = $n|pow(2,23);
    }
    if($g1 == "스포츠"){
        $n = $n|pow(2,24);
    }
    if($g1 == "에로티카"||$g1=="에로틱 스틸러"||$g1=="애로틱 스릴러"){
        $n = $n|pow(2,25);
    }
    if($g1 == "필름 누아르"){
        $n = $n|pow(2,26);
    }
    if($g1 == "초자연적 현상"||$g1=="포스트 아포칼립스픽션"||$g1=="재난 영화"||$g1=="괴수 영화"||$g1=="Survival film"){
        $n = $n|pow(2,27);
    }
    if($g1 == "정치 스릴러"||$g1=="정치 드라마"){
        $n = $n|pow(2,28);
    }
    if($g1 == "다큐드라마"||$g1=="범죄 다큐멘터리"||$g1=="Nature documentary"||$g1=="성장 스토리"||$g1 == "다큐멘터리"){
        $n = $n|pow(2,29);
    }
    if($g1 == "법정드라마"){
        $n = $n|pow(2,30);
    }



    if($g2=="액션 영화"||$g2=="액션"||$g2=="액션 스릴러"||$g2=="액션어드벤처"||$g2=="무협 영화"){
        $n = $n|pow(2,0);
    }
    if($g2 == "스릴러"||$g2=="액션 스릴러"||$g2=="심리스릴러"||$g2=="하이스트 영화"||$g2=="심리호러"||$g2=="슬래셔 영화"||$g2=="애로틱 스릴러"||$g2=="정치 스릴러"||$g2=="서스펜스"){
        $n = $n|pow(2,1);
    }
    if($g2 =="드라마"||$g2=="역사 드라마"||$g2=="코미디 드라마"||$g2=="음악 드라마"||$g2=="버디 영화"||$g2=="멜로드라마"||$g2=="정치 드라마"||$g2=="다큐드라마"||$g2=="법정드라마"||$g2=="성장 스토리"||$g2=="전기"||$g2=="Survival film"){
        $n = $n|pow(2,2);
    }
    if($g2 == "전쟁 영화"){
        $n = $n|pow(2,3);
    }
    if($g2 == "첩보영화"){
        $n = $n|pow(2,4);
    }
    if($g2 == "모험 영화"||$g2=="액션어드벤처"||$g2=="Survival film"){
        $n = $n|pow(2,5);
    }
    if($g2 == "역사"||$g2=="서사 영화"||$g2=="역사허구물"||$g2=="역사 드라마"||$g2=="시대물"||$g2=="역사 로맨스"||$g2=="사극"||$g2=="무협 영화"){
        $n = $n|pow(2,6);
    }
    if($g2 == "서부극"||$g2=="스파게티 웨스턴"){
        $n = $n|pow(2,7);
    }
    if($g2 == "판타지 영화"||$g2=="판타지"){
        $n = $n|pow(2,8);
    }
    if($g2 == "풍자"||$g2=="풍습희극"||$g2=="풍속소설"){
        $n = $n|pow(2,9);
    }
    if($g2 == "코미디 영화"||$g2=="코미디 드라마"||$g2=="코미디"||$g2=="뮤지컬 코미디"||$g2=="로맨틱 코미디"||$g2=="블랙 코미디"||$g2=="풍습희극"||$g2=="호러 코미디"||$g2=="뮤지컬 코미디"||$g2=="패러디"||$g2=="희극"||$g2=="스크루볼 코미디"){
        $n = $n|pow(2,10);
    }
    if($g2 == "로맨스"||$g2=="로맨틱 코미디"||$g2=="멜로/로맨스"||$g2=="연애 소설"||$g2=="역사 로맨스"){
        $n = $n|pow(2,11);
    }
    if($g2 == "가족 영화"||$g2=="가족"){
        $n = $n|pow(2,12);
    }
    if($g2 == "음악 드라마"||$g2=="음악 장르"||$g2=="음악"||$g2=="콘서트 영화"){
        $n = $n|pow(2,13);
    }
    if($g2 == "뮤지컬 코미디"||$g2=="백스테이지 뮤지컬"||$g2=="뮤지컬 코미디"){
        $n = $n|pow(2,14);
    }
    if($g2 == "범죄 영화"||$g2=="하이스트 영화"||$g2=="범죄물"||$g2=="슬래셔 영화"||$g2=="스플래터 영화"||$g2=="범죄 다큐멘터리"||$g2=="추리물"||$g2=="범죄"){
        $n = $n|pow(2,15);
    }
    if($g2 ==  "미스터리 영화"||$g2=="미스터리"||$g2=="심리호러"||$g2=="추리물"){
        $n = $n|pow(2,16);
    }
    if($g2 == "멜로드라마"||$g2=="멜로드라마"||$g2=="멜로/로맨스"||$g2=="멜로드라마"){
        $n = $n|pow(2,17);
    }
    if($g2 == "애니매이션"||$g2=="일본의 애니메이션"||$g2 == "애니메이션"){
        $n = $n|pow(2,18);
    }
    if($g2 == "SF 영화"||$g2=="공상 과학"||$g2=="포스트 아포칼립스픽션"||$g2=="픽션"||$g2=="스팀펑크"){
        $n = $n|pow(2,19);
    }
    if($g2 == "종교 영화"||$g2=="알레고리"){
        $n = $n|pow(2,20);
    }
    if($g2 == "공포 영화"||$g2=="호러 코미디"||$g2=="심리호러"||$g2=="슬래셔 영화"||$g2=="스플래터 영화"||$g2=="괴수 영화"||$g2=="심리호러"||$g2=="공포(호러)"){
        $n = $n|pow(2,21);
    }
    if($g2 == "댄스영화"){
        $n = $n|pow(2,22);
    }
    if($g2 == "슈퍼히어로영화"){
        $n = $n|pow(2,23);
    }
    if($g2 == "스포츠"){
        $n = $n|pow(2,24);
    }
    if($g2 == "에로티카"||$g2=="에로틱 스틸러"||$g2=="애로틱 스릴러"){
        $n = $n|pow(2,25);
    }
    if($g2 == "필름 누아르"){
        $n = $n|pow(2,26);
    }
    if($g2 == "초자연적 현상"||$g2=="포스트 아포칼립스픽션"||$g2=="재난 영화"||$g2=="괴수 영화"||$g2=="Survival film"){
        $n = $n|pow(2,27);
    }
    if($g2 == "정치 스릴러"||$g2=="정치 드라마"){
        $n = $n|pow(2,28);
    }
    if($g2 == "다큐드라마"||$g2=="범죄 다큐멘터리"||$g2=="Nature documentary"||$g2=="성장 스토리"||$g2 == "다큐멘터리"){
        $n = $n|pow(2,29);
    }
    if($g2 == "법정드라마"){
        $n = $n|pow(2,30);
    }


    if($g3=="액션 영화"||$g3=="액션"||$g3=="액션 스릴러"||$g3=="액션어드벤처"||$g3=="무협 영화"){
        $n = $n|pow(2,0);
    }
    if($g3 == "스릴러"||$g3=="액션 스릴러"||$g3=="심리스릴러"||$g3=="하이스트 영화"||$g3=="심리호러"||"슬래셔 영화"||$g3=="애로틱 스릴러"||$g3=="정치 스릴러"||$g3=="서스펜스"){
        $n = $n|pow(2,1);
    }
    if($g3 =="드라마"||$g3=="역사 드라마"||$g3=="코미디 드라마"||$g3=="음악 드라마"||$g3=="버디 영화"||$g3=="멜로드라마"||$g3=="정치 드라마"||$g3=="다큐드라마"||$g3=="법정드라마"||$g3=="성장 스토리"||$g3=="전기"||$g3=="Survival film"){
        $n = $n|pow(2,2);
    }
    if($g3 == "전쟁 영화"){
        $n = $n|pow(2,3);
    }
    if($g3 == "첩보영화"){
        $n = $n|pow(2,4);
    }
    if($g3 == "모험 영화"||$g3=="액션어드벤처"||$g3=="Survival film"){
        $n = $n|pow(2,5);
    }
    if($g3 == "역사"||$g3=="서사 영화"||$g3=="역사허구물"||$g3=="역사 드라마"||$g3=="시대물"||$g3=="역사 로맨스"||$g3=="사극"||$g3=="무협 영화"){
        $n = $n|pow(2,6);
    }
    if($g3 == "서부극"||$g3=="스파게티 웨스턴"){
        $n = $n|pow(2,7);
    }
    if($g3 == "판타지 영화"||$g3=="판타지"){
        $n = $n|pow(2,8);
    }
    if($g3 == "풍자"||$g3=="풍습희극"||$g3=="풍속소설"){
        $n = $n|pow(2,9);
    }
    if($g3 == "코미디 영화"||$g3=="코미디 드라마"||$g3=="코미디"||$g3=="뮤지컬 코미디"||$g3=="로맨틱 코미디"||$g3=="블랙 코미디"||$g3=="풍습희극"||$g3=="호러 코미디"||$g3=="뮤지컬 코미디"||$g3=="패러디"||$g3=="희극"||$g3=="스크루볼 코미디"){
        $n = $n|pow(2,10);
    }
    if($g3 == "로맨스"||$g3=="로맨틱 코미디"||$g3=="멜로/로맨스"||$g3=="연애 소설"||$g3=="역사 로맨스"){
        $n = $n|pow(2,11);
    }
    if($g3 == "가족 영화"||$g3=="가족"){
        $n = $n|pow(2,12);
    }
    if($g3 == "음악 드라마"||$g3=="음악 장르"||$g3=="음악"||$g3=="콘서트 영화"){
        $n = $n|pow(2,13);
    }
    if($g3 == "뮤지컬 코미디"||$g3=="백스테이지 뮤지컬"||$g3=="뮤지컬 코미디"){
        $n = $n|pow(2,14);
    }
    if($g3 == "범죄 영화"||$g3=="하이스트 영화"||$g3=="범죄물"||$g3=="슬래셔 영화"||$g3=="스플래터 영화"||$g3=="범죄 다큐멘터리"||$g3=="추리물"||$g3=="범죄"){
        $n = $n|pow(2,15);
    }
    if($g3 ==  "미스터리 영화"||$g3=="미스터리"||$g3=="심리호러"||$g3=="추리물"){
        $n = $n|pow(2,16);
    }
    if($g3 == "멜로드라마"||$g3=="멜로드라마"||$g3=="멜로/로맨스"||$g3=="멜로드라마"){
        $n = $n|pow(2,17);
    }
    if($g3 == "애니매이션"||$g3=="일본의 애니메이션"||$g3 == "애니메이션"){
        $n = $n|pow(2,18);
    }
    if($g3 == "SF 영화"||$g3=="공상 과학"||$g3=="포스트 아포칼립스픽션"||$g3=="픽션"||$g3=="스팀펑크"){
        $n = $n|pow(2,19);
    }
    if($g3 == "종교 영화"||$g3=="알레고리"){
        $n = $n|pow(2,20);
    }
    if($g3 == "공포 영화"||$g3=="호러 코미디"||$g3=="심리호러"||$g3=="슬래셔 영화"||$g3=="스플래터 영화"||$g3=="괴수 영화"||$g3=="심리호러"||$g3=="공포(호러)"){
        $n = $n|pow(2,21);
    }
    if($g3 == "댄스영화"){
        $n = $n|pow(2,22);
    }
    if($g3 == "슈퍼히어로영화"){
        $n = $n|pow(2,23);
    }
    if($g3 == "스포츠"){
        $n = $n|pow(2,24);
    }
    if($g3 == "에로티카"||$g3=="에로틱 스틸러"||$g3=="애로틱 스릴러"){
        $n = $n|pow(2,25);
    }
    if($g3 == "필름 누아르"){
        $n = $n|pow(2,26);
    }
    if($g3 == "초자연적 현상"||$g3=="포스트 아포칼립스픽션"||$g3=="재난 영화"||$g3=="괴수 영화"||$g3=="Survival film"){
        $n = $n|pow(2,27);
    }
    if($g3 == "정치 스릴러"||$g3=="정치 드라마"){
        $n = $n|pow(2,28);
    }
    if($g3 == "다큐드라마"||$g3=="범죄 다큐멘터리"||$g3=="Nature documentary"||$g3=="성장 스토리"||$g3 == "다큐멘터리"){
        $n = $n|pow(2,29);
    }
    if($g3 == "법정드라마"){
        $n = $n|pow(2,30);
    }



    if($g4=="액션 영화"||$g4=="액션"||$g4=="액션 스릴러"||$g4=="액션어드벤처"||$g4=="무협 영화"){
        $n = $n|pow(2,0);
    }
    if($g4 == "스릴러"||$g4=="액션 스릴러"||$g4=="심리스릴러"||$g4=="하이스트 영화"||$g4=="심리호러"||$g4=="슬래셔 영화"||$g4=="애로틱 스릴러"||$g4=="정치 스릴러"||$g4=="서스펜스"){
        $n = $n|pow(2,1);
    }
    if($g4 =="드라마"||$g4=="역사 드라마"||$g4=="코미디 드라마"||$g4=="음악 드라마"||$g4=="버디 영화"||$g4=="멜로드라마"||$g4=="정치 드라마"||$g4=="다큐드라마"||$g4=="법정드라마"||$g4=="성장 스토리"||$g4=="전기"||$g4=="Survival film"){
        $n = $n|pow(2,2);
    }
    if($g4 == "전쟁 영화"){
        $n = $n|pow(2,3);
    }
    if($g4 == "첩보영화"){
        $n = $n|pow(2,4);
    }
    if($g4 == "모험 영화"||$g4=="액션어드벤처"||$g4=="Survival film"){
        $n = $n|pow(2,5);
    }
    if($g4 == "역사"||$g4=="서사 영화"||$g4=="역사허구물"||$g4=="역사 드라마"||$g4=="시대물"||$g4=="역사 로맨스"||$g4=="사극"||$g4=="무협 영화"){
        $n = $n|pow(2,6);
    }
    if($g4 == "서부극"||$g4=="스파게티 웨스턴"){
        $n = $n|pow(2,7);
    }
    if($g4 == "판타지 영화"||$g4=="판타지"){
        $n = $n|pow(2,8);
    }
    if($g4 == "풍자"||$g4=="풍습희극"||$g4=="풍속소설"){
        $n = $n|pow(2,9);
    }
    if($g4 == "코미디 영화"||$g4=="코미디 드라마"||$g4=="코미디"||$g4=="뮤지컬 코미디"||$g4=="로맨틱 코미디"||$g4=="블랙 코미디"||$g4=="풍습희극"||$g4=="호러 코미디"||$g4=="뮤지컬 코미디"||$g4=="패러디"||$g4=="희극"||$g4=="스크루볼 코미디"){
        $n = $n|pow(2,10);
    }
    if($g4 == "로맨스"||$g4=="로맨틱 코미디"||$g4=="멜로/로맨스"||$g4=="연애 소설"||$g4=="역사 로맨스"){
        $n = $n|pow(2,11);
    }
    if($g4 == "가족 영화"||$g4=="가족"){
        $n = $n|pow(2,12);
    }
    if($g4 == "음악 드라마"||$g4=="음악 장르"||$g4=="음악"||$g4=="콘서트 영화"){
        $n = $n|pow(2,13);
    }
    if($g4 == "뮤지컬 코미디"||$g4=="백스테이지 뮤지컬"||$g4=="뮤지컬 코미디"){
        $n = $n|pow(2,14);
    }
    if($g4 == "범죄 영화"||$g4=="하이스트 영화"||$g4=="범죄물"||$g4=="슬래셔 영화"||$g4=="스플래터 영화"||$g4=="범죄 다큐멘터리"||$g4=="추리물"||$g4=="범죄"){
        $n = $n|pow(2,15);
    }
    if($g4 ==  "미스터리 영화"||$g4=="미스터리"||$g4=="심리호러"||$g4=="추리물"){
        $n = $n|pow(2,16);
    }
    if($g4 == "멜로드라마"||$g4=="멜로드라마"||$g4=="멜로/로맨스"||$g4=="멜로드라마"){
        $n = $n|pow(2,17);
    }
    if($g4 == "애니매이션"||$g4=="일본의 애니메이션"||$g4 == "애니메이션"){
        $n = $n|pow(2,18);
    }
    if($g4 == "SF 영화"||$g4=="공상 과학"||$g4=="포스트 아포칼립스픽션"||$g4=="픽션"||$g4=="스팀펑크"){
        $n = $n|pow(2,19);
    }
    if($g4 == "종교 영화"||$g4=="알레고리"){
        $n = $n|pow(2,20);
    }
    if($g4 == "공포 영화"||$g4=="호러 코미디"||$g4=="심리호러"||$g4=="슬래셔 영화"||$g4=="스플래터 영화"||$g4=="괴수 영화"||$g4=="심리호러"||$g4=="공포(호러)"){
        $n = $n|pow(2,21);
    }
    if($g4 == "댄스영화"){
        $n = $n|pow(2,22);
    }
    if($g4 == "슈퍼히어로영화"){
        $n = $n|pow(2,23);
    }
    if($g4 == "스포츠"){
        $n = $n|pow(2,24);
    }
    if($g4 == "에로티카"||$g4=="에로틱 스틸러"||$g4=="애로틱 스릴러"){
        $n = $n|pow(2,25);
    }
    if($g4 == "필름 누아르"){
        $n = $n|pow(2,26);
    }
    if($g4 == "초자연적 현상"||$g4=="포스트 아포칼립스픽션"||$g4=="재난 영화"||$g4=="괴수 영화"||$g4=="Survival film"){
        $n = $n|pow(2,27);
    }
    if($g4 == "정치 스릴러"||$g4=="정치 드라마"){
        $n = $n|pow(2,28);
    }
    if($g4 == "다큐드라마"||$g4=="범죄 다큐멘터리"||$g4=="Nature documentary"||$g4=="성장 스토리"||$g4 == "다큐멘터리"){
        $n = $n|pow(2,29);
    }
    if($g4 == "법정드라마"){
        $n = $n|pow(2,30);
    }

    return $n;

}
function genreNum3($g1, $g2, $g3){
    $n=0;
    if($g1=="액션 영화"||$g1=="액션"||$g1=="액션 스릴러"||$g1=="액션어드벤처"||$g1=="무협 영화"){
        $n = $n|pow(2,0);
    }
    if($g1 == "스릴러"||$g1=="액션 스릴러"||$g1=="심리스릴러"||$g1=="하이스트 영화"||$g1=="심리호러"||$g1=="슬래셔 영화"||$g1=="애로틱 스릴러"||$g1=="정치 스릴러"||$g1=="서스펜스"){
        $n = $n|pow(2,1);
    }
    if($g1 =="드라마"||$g1=="역사 드라마"||$g1=="코미디 드라마"||$g1=="음악 드라마"||$g1=="버디 영화"||$g1=="멜로드라마"||$g1=="정치 드라마"||$g1=="다큐드라마"||$g1=="법정드라마"||$g1=="성장 스토리"||$g1=="전기"||$g1=="Survival film"){
        $n = $n|pow(2,2);
    }
    if($g1 == "전쟁 영화"){
        $n = $n|pow(2,3);
    }
    if($g1 == "첩보영화"){
        $n = $n|pow(2,4);
    }
    if($g1 == "모험 영화"||$g1=="액션어드벤처"||$g1=="Survival film"){
        $n = $n|pow(2,5);
    }
    if($g1 == "역사"||$g1=="서사 영화"||$g1=="역사허구물"||$g1=="역사 드라마"||$g1=="시대물"||$g1=="역사 로맨스"||$g1=="사극"||$g1=="무협 영화"){
        $n = $n|pow(2,6);
    }
    if($g1 == "서부극"||$g1=="스파게티 웨스턴"){
        $n = $n|pow(2,7);
    }
    if($g1 == "판타지 영화"||$g1=="판타지"){
        $n = $n|pow(2,8);
    }
    if($g1 == "풍자"||$g1=="풍습희극"||$g1=="풍속소설"){
        $n = $n|pow(2,9);
    }
    if($g1 == "코미디 영화"||$g1=="코미디 드라마"||$g1=="코미디"||$g1=="뮤지컬 코미디"||$g1=="로맨틱 코미디"||$g1=="블랙 코미디"||$g1=="풍습희극"||$g1=="호러 코미디"||$g1=="뮤지컬 코미디"||$g1=="패러디"||$g1=="희극"||$g1=="스크루볼 코미디"){
        $n = $n|pow(2,10);
    }
    if($g1 == "로맨스"||$g1=="로맨틱 코미디"||$g1=="멜로/로맨스"||$g1=="연애 소설"||$g1=="역사 로맨스"){
        $n = $n|pow(2,11);
    }
    if($g1 == "가족 영화"||$g1=="가족"){
        $n = $n|pow(2,12);
    }
    if($g1 == "음악 드라마"||$g1=="음악 장르"||$g1=="음악"||$g1=="콘서트 영화"){
        $n = $n|pow(2,13);
    }
    if($g1 == "뮤지컬 코미디"||$g1=="백스테이지 뮤지컬"||$g1=="뮤지컬 코미디"){
        $n = $n|pow(2,14);
    }
    if($g1 == "범죄 영화"||$g1=="하이스트 영화"||$g1=="범죄물"||$g1=="슬래셔 영화"||$g1=="스플래터 영화"||$g1=="범죄 다큐멘터리"||$g1=="추리물"||$g1=="범죄"){
        $n = $n|pow(2,15);
    }
    if($g1 ==  "미스터리 영화"||$g1=="미스터리"||$g1=="심리호러"||$g1=="추리물"){
        $n = $n|pow(2,16);
    }
    if($g1 == "멜로드라마"||$g1=="멜로드라마"||$g1=="멜로/로맨스"||$g1=="멜로드라마"){
        $n = $n|pow(2,17);
    }
    if($g1 == "애니매이션"||$g1=="일본의 애니메이션"||$g1 == "애니메이션"){
        $n = $n|pow(2,18);
    }
    if($g1 == "SF 영화"||$g1=="공상 과학"||$g1=="포스트 아포칼립스픽션"||$g1=="픽션"||$g1=="스팀펑크"){
        $n = $n|pow(2,19);
    }
    if($g1 == "종교 영화"||$g1 =="알레고리"){
        $n = $n|pow(2,20);
    }
    if($g1 == "공포 영화"||$g1=="호러 코미디"||$g1=="심리호러"||$g1=="슬래셔 영화"||$g1=="스플래터 영화"||$g1=="괴수 영화"||$g1=="심리호러"||$g1=="공포(호러)"){
        $n = $n|pow(2,21);
    }
    if($g1 == "댄스영화"){
        $n = $n|pow(2,22);
    }
    if($g1 == "슈퍼히어로영화"){
        $n = $n|pow(2,23);
    }
    if($g1 == "스포츠"){
        $n = $n|pow(2,24);
    }
    if($g1 == "에로티카"||$g1=="에로틱 스틸러"||$g1=="애로틱 스릴러"){
        $n = $n|pow(2,25);
    }
    if($g1 == "필름 누아르"){
        $n = $n|pow(2,26);
    }
    if($g1 == "초자연적 현상"||$g1=="포스트 아포칼립스픽션"||$g1=="재난 영화"||$g1=="괴수 영화"||$g1=="Survival film"){
        $n = $n|pow(2,27);
    }
    if($g1 == "정치 스릴러"||$g1=="정치 드라마"){
        $n = $n|pow(2,28);
    }
    if($g1 == "다큐드라마"||$g1=="범죄 다큐멘터리"||$g1=="Nature documentary"||$g1=="성장 스토리"||$g1 == "다큐멘터리"){
        $n = $n|pow(2,29);
    }
    if($g1 == "법정드라마"){
        $n = $n|pow(2,30);
    }



    if($g2=="액션 영화"||$g2=="액션"||$g2=="액션 스릴러"||$g2=="액션어드벤처"||$g2=="무협 영화"){
        $n = $n|pow(2,0);
    }
    if($g2 == "스릴러"||$g2=="액션 스릴러"||$g2=="심리스릴러"||$g2=="하이스트 영화"||$g2=="심리호러"||$g2=="슬래셔 영화"||$g2=="애로틱 스릴러"||$g2=="정치 스릴러"||$g2=="서스펜스"){
        $n = $n|pow(2,1);
    }
    if($g2 =="드라마"||$g2=="역사 드라마"||$g2=="코미디 드라마"||$g2=="음악 드라마"||$g2=="버디 영화"||$g2=="멜로드라마"||$g2=="정치 드라마"||$g2=="다큐드라마"||$g2=="법정드라마"||$g2=="성장 스토리"||$g2=="전기"||$g2=="Survival film"){
        $n = $n|pow(2,2);
    }
    if($g2 == "전쟁 영화"){
        $n = $n|pow(2,3);
    }
    if($g2 == "첩보영화"){
        $n = $n|pow(2,4);
    }
    if($g2 == "모험 영화"||$g2=="액션어드벤처"||$g2=="Survival film"){
        $n = $n|pow(2,5);
    }
    if($g2 == "역사"||$g2=="서사 영화"||$g2=="역사허구물"||$g2=="역사 드라마"||$g2=="시대물"||$g2=="역사 로맨스"||$g2=="사극"||$g2=="무협 영화"){
        $n = $n|pow(2,6);
    }
    if($g2 == "서부극"||$g2=="스파게티 웨스턴"){
        $n = $n|pow(2,7);
    }
    if($g2 == "판타지 영화"||$g2=="판타지"){
        $n = $n|pow(2,8);
    }
    if($g2 == "풍자"||$g2=="풍습희극"||$g2=="풍속소설"){
        $n = $n|pow(2,9);
    }
    if($g2 == "코미디 영화"||$g2=="코미디 드라마"||$g2=="코미디"||$g2=="뮤지컬 코미디"||$g2=="로맨틱 코미디"||$g2=="블랙 코미디"||$g2=="풍습희극"||$g2=="호러 코미디"||$g2=="뮤지컬 코미디"||$g2=="패러디"||$g2=="희극"||$g2=="스크루볼 코미디"){
        $n = $n|pow(2,10);
    }
    if($g2 == "로맨스"||$g2=="로맨틱 코미디"||$g2=="멜로/로맨스"||$g2=="연애 소설"||$g2=="역사 로맨스"){
        $n = $n|pow(2,11);
    }
    if($g2 == "가족 영화"||$g2=="가족"){
        $n = $n|pow(2,12);
    }
    if($g2 == "음악 드라마"||$g2=="음악 장르"||$g2=="음악"||$g2=="콘서트 영화"){
        $n = $n|pow(2,13);
    }
    if($g2 == "뮤지컬 코미디"||$g2=="백스테이지 뮤지컬"||$g2=="뮤지컬 코미디"){
        $n = $n|pow(2,14);
    }
    if($g2 == "범죄 영화"||$g2=="하이스트 영화"||$g2=="범죄물"||$g2=="슬래셔 영화"||$g2=="스플래터 영화"||$g2=="범죄 다큐멘터리"||$g2=="추리물"||$g2=="범죄"){
        $n = $n|pow(2,15);
    }
    if($g2 ==  "미스터리 영화"||$g2=="미스터리"||$g2=="심리호러"||$g2=="추리물"){
        $n = $n|pow(2,16);
    }
    if($g2 == "멜로드라마"||$g2=="멜로드라마"||$g2=="멜로/로맨스"||$g2=="멜로드라마"){
        $n = $n|pow(2,17);
    }
    if($g2 == "애니매이션"||$g2=="일본의 애니메이션"||$g2 == "애니메이션"){
        $n = $n|pow(2,18);
    }
    if($g2 == "SF 영화"||$g2=="공상 과학"||$g2=="포스트 아포칼립스픽션"||$g2=="픽션"||$g2=="스팀펑크"){
        $n = $n|pow(2,19);
    }
    if($g2 == "종교 영화"||$g2=="알레고리"){
        $n = $n|pow(2,20);
    }
    if($g2 == "공포 영화"||$g2=="호러 코미디"||$g2=="심리호러"||$g2=="슬래셔 영화"||$g2=="스플래터 영화"||$g2=="괴수 영화"||$g2=="심리호러"||$g2=="공포(호러)"){
        $n = $n|pow(2,21);
    }
    if($g2 == "댄스영화"){
        $n = $n|pow(2,22);
    }
    if($g2 == "슈퍼히어로영화"){
        $n = $n|pow(2,23);
    }
    if($g2 == "스포츠"){
        $n = $n|pow(2,24);
    }
    if($g2 == "에로티카"||$g2=="에로틱 스틸러"||$g2=="애로틱 스릴러"){
        $n = $n|pow(2,25);
    }
    if($g2 == "필름 누아르"){
        $n = $n|pow(2,26);
    }
    if($g2 == "초자연적 현상"||$g2=="포스트 아포칼립스픽션"||$g2=="재난 영화"||$g2=="괴수 영화"||$g2=="Survival film"){
        $n = $n|pow(2,27);
    }
    if($g2 == "정치 스릴러"||$g2=="정치 드라마"){
        $n = $n|pow(2,28);
    }
    if($g2 == "다큐드라마"||$g2=="범죄 다큐멘터리"||$g2=="Nature documentary"||$g2=="성장 스토리"||$g2 == "다큐멘터리"){
        $n = $n|pow(2,29);
    }
    if($g2 == "법정드라마"){
        $n = $n|pow(2,30);
    }


    if($g3=="액션 영화"||$g3=="액션"||$g3=="액션 스릴러"||$g3=="액션어드벤처"||$g3=="무협 영화"){
        $n = $n|pow(2,0);
    }
    if($g3 == "스릴러"||$g3=="액션 스릴러"||$g3=="심리스릴러"||$g3=="하이스트 영화"||$g3=="심리호러"||"슬래셔 영화"||$g3=="애로틱 스릴러"||$g3=="정치 스릴러"||$g3=="서스펜스"){
        $n = $n|pow(2,1);
    }
    if($g3 =="드라마"||$g3=="역사 드라마"||$g3=="코미디 드라마"||$g3=="음악 드라마"||$g3=="버디 영화"||$g3=="멜로드라마"||$g3=="정치 드라마"||$g3=="다큐드라마"||$g3=="법정드라마"||$g3=="성장 스토리"||$g3=="전기"||$g3=="Survival film"){
        $n = $n|pow(2,2);
    }
    if($g3 == "전쟁 영화"){
        $n = $n|pow(2,3);
    }
    if($g3 == "첩보영화"){
        $n = $n|pow(2,4);
    }
    if($g3 == "모험 영화"||$g3=="액션어드벤처"||$g3=="Survival film"){
        $n = $n|pow(2,5);
    }
    if($g3 == "역사"||$g3=="서사 영화"||$g3=="역사허구물"||$g3=="역사 드라마"||$g3=="시대물"||$g3=="역사 로맨스"||$g3=="사극"||$g3=="무협 영화"){
        $n = $n|pow(2,6);
    }
    if($g3 == "서부극"||$g3=="스파게티 웨스턴"){
        $n = $n|pow(2,7);
    }
    if($g3 == "판타지 영화"||$g3=="판타지"){
        $n = $n|pow(2,8);
    }
    if($g3 == "풍자"||$g3=="풍습희극"||$g3=="풍속소설"){
        $n = $n|pow(2,9);
    }
    if($g3 == "코미디 영화"||$g3=="코미디 드라마"||$g3=="코미디"||$g3=="뮤지컬 코미디"||$g3=="로맨틱 코미디"||$g3=="블랙 코미디"||$g3=="풍습희극"||$g3=="호러 코미디"||$g3=="뮤지컬 코미디"||$g3=="패러디"||$g3=="희극"||$g3=="스크루볼 코미디"){
        $n = $n|pow(2,10);
    }
    if($g3 == "로맨스"||$g3=="로맨틱 코미디"||$g3=="멜로/로맨스"||$g3=="연애 소설"||$g3=="역사 로맨스"){
        $n = $n|pow(2,11);
    }
    if($g3 == "가족 영화"||$g3=="가족"){
        $n = $n|pow(2,12);
    }
    if($g3 == "음악 드라마"||$g3=="음악 장르"||$g3=="음악"||$g3=="콘서트 영화"){
        $n = $n|pow(2,13);
    }
    if($g3 == "뮤지컬 코미디"||$g3=="백스테이지 뮤지컬"||$g3=="뮤지컬 코미디"){
        $n = $n|pow(2,14);
    }
    if($g3 == "범죄 영화"||$g3=="하이스트 영화"||$g3=="범죄물"||$g3=="슬래셔 영화"||$g3=="스플래터 영화"||$g3=="범죄 다큐멘터리"||$g3=="추리물"||$g3=="범죄"){
        $n = $n|pow(2,15);
    }
    if($g3 ==  "미스터리 영화"||$g3=="미스터리"||$g3=="심리호러"||$g3=="추리물"){
        $n = $n|pow(2,16);
    }
    if($g3 == "멜로드라마"||$g3=="멜로드라마"||$g3=="멜로/로맨스"||$g3=="멜로드라마"){
        $n = $n|pow(2,17);
    }
    if($g3 == "애니매이션"||$g3=="일본의 애니메이션"||$g3 == "애니메이션"){
        $n = $n|pow(2,18);
    }
    if($g3 == "SF 영화"||$g3=="공상 과학"||$g3=="포스트 아포칼립스픽션"||$g3=="픽션"||$g3=="스팀펑크"){
        $n = $n|pow(2,19);
    }
    if($g3 == "종교 영화"||$g3=="알레고리"){
        $n = $n|pow(2,20);
    }
    if($g3 == "공포 영화"||$g3=="호러 코미디"||$g3=="심리호러"||$g3=="슬래셔 영화"||$g3=="스플래터 영화"||$g3=="괴수 영화"||$g3=="심리호러"||$g3=="공포(호러)"){
        $n = $n|pow(2,21);
    }
    if($g3 == "댄스영화"){
        $n = $n|pow(2,22);
    }
    if($g3 == "슈퍼히어로영화"){
        $n = $n|pow(2,23);
    }
    if($g3 == "스포츠"){
        $n = $n|pow(2,24);
    }
    if($g3 == "에로티카"||$g3=="에로틱 스틸러"||$g3=="애로틱 스릴러"){
        $n = $n|pow(2,25);
    }
    if($g3 == "필름 누아르"){
        $n = $n|pow(2,26);
    }
    if($g3 == "초자연적 현상"||$g3=="포스트 아포칼립스픽션"||$g3=="재난 영화"||$g3=="괴수 영화"||$g3=="Survival film"){
        $n = $n|pow(2,27);
    }
    if($g3 == "정치 스릴러"||$g3=="정치 드라마"){
        $n = $n|pow(2,28);
    }
    if($g3 == "다큐드라마"||$g3=="범죄 다큐멘터리"||$g3=="Nature documentary"||$g3=="성장 스토리"||$g3 == "다큐멘터리"){
        $n = $n|pow(2,29);
    }
    if($g3 == "법정드라마"){
        $n = $n|pow(2,30);
    }

    return $n;

}

function genreNum2($g1, $g2){
    $n=0;
    if($g1=="액션 영화"||$g1=="액션"||$g1=="액션 스릴러"||$g1=="액션어드벤처"||$g1=="무협 영화"){
        $n = $n|pow(2,0);
    }
    if($g1 == "스릴러"||$g1=="액션 스릴러"||$g1=="심리스릴러"||$g1=="하이스트 영화"||$g1=="심리호러"||$g1=="슬래셔 영화"||$g1=="애로틱 스릴러"||$g1=="정치 스릴러"||$g1=="서스펜스"){
        $n = $n|pow(2,1);
    }
    if($g1 =="드라마"||$g1=="역사 드라마"||$g1=="코미디 드라마"||$g1=="음악 드라마"||$g1=="버디 영화"||$g1=="멜로드라마"||$g1=="정치 드라마"||$g1=="다큐드라마"||$g1=="법정드라마"||$g1=="성장 스토리"||$g1=="전기"||$g1=="Survival film"){
        $n = $n|pow(2,2);
    }
    if($g1 == "전쟁 영화"){
        $n = $n|pow(2,3);
    }
    if($g1 == "첩보영화"){
        $n = $n|pow(2,4);
    }
    if($g1 == "모험 영화"||$g1=="액션어드벤처"||$g1=="Survival film"){
        $n = $n|pow(2,5);
    }
    if($g1 == "역사"||$g1=="서사 영화"||$g1=="역사허구물"||$g1=="역사 드라마"||$g1=="시대물"||$g1=="역사 로맨스"||$g1=="사극"||$g1=="무협 영화"){
        $n = $n|pow(2,6);
    }
    if($g1 == "서부극"||$g1=="스파게티 웨스턴"){
        $n = $n|pow(2,7);
    }
    if($g1 == "판타지 영화"||$g1=="판타지"){
        $n = $n|pow(2,8);
    }
    if($g1 == "풍자"||$g1=="풍습희극"||$g1=="풍속소설"){
        $n = $n|pow(2,9);
    }
    if($g1 == "코미디 영화"||$g1=="코미디 드라마"||$g1=="코미디"||$g1=="뮤지컬 코미디"||$g1=="로맨틱 코미디"||$g1=="블랙 코미디"||$g1=="풍습희극"||$g1=="호러 코미디"||$g1=="뮤지컬 코미디"||$g1=="패러디"||$g1=="희극"||$g1=="스크루볼 코미디"){
        $n = $n|pow(2,10);
    }
    if($g1 == "로맨스"||$g1=="로맨틱 코미디"||$g1=="멜로/로맨스"||$g1=="연애 소설"||$g1=="역사 로맨스"){
        $n = $n|pow(2,11);
    }
    if($g1 == "가족 영화"||$g1=="가족"){
        $n = $n|pow(2,12);
    }
    if($g1 == "음악 드라마"||$g1=="음악 장르"||$g1=="음악"||$g1=="콘서트 영화"){
        $n = $n|pow(2,13);
    }
    if($g1 == "뮤지컬 코미디"||$g1=="백스테이지 뮤지컬"||$g1=="뮤지컬 코미디"){
        $n = $n|pow(2,14);
    }
    if($g1 == "범죄 영화"||$g1=="하이스트 영화"||$g1=="범죄물"||$g1=="슬래셔 영화"||$g1=="스플래터 영화"||$g1=="범죄 다큐멘터리"||$g1=="추리물"||$g1=="범죄"){
        $n = $n|pow(2,15);
    }
    if($g1 ==  "미스터리 영화"||$g1=="미스터리"||$g1=="심리호러"||$g1=="추리물"){
        $n = $n|pow(2,16);
    }
    if($g1 == "멜로드라마"||$g1=="멜로드라마"||$g1=="멜로/로맨스"||$g1=="멜로드라마"){
        $n = $n|pow(2,17);
    }
    if($g1 == "애니매이션"||$g1=="일본의 애니메이션"||$g1 == "애니메이션"){
        $n = $n|pow(2,18);
    }
    if($g1 == "SF 영화"||$g1=="공상 과학"||$g1=="포스트 아포칼립스픽션"||$g1=="픽션"||$g1=="스팀펑크"){
        $n = $n|pow(2,19);
    }
    if($g1 == "종교 영화"||$g1 =="알레고리"){
        $n = $n|pow(2,20);
    }
    if($g1 == "공포 영화"||$g1=="호러 코미디"||$g1=="심리호러"||$g1=="슬래셔 영화"||$g1=="스플래터 영화"||$g1=="괴수 영화"||$g1=="심리호러"||$g1=="공포(호러)"){
        $n = $n|pow(2,21);
    }
    if($g1 == "댄스영화"){
        $n = $n|pow(2,22);
    }
    if($g1 == "슈퍼히어로영화"){
        $n = $n|pow(2,23);
    }
    if($g1 == "스포츠"){
        $n = $n|pow(2,24);
    }
    if($g1 == "에로티카"||$g1=="에로틱 스틸러"||$g1=="애로틱 스릴러"){
        $n = $n|pow(2,25);
    }
    if($g1 == "필름 누아르"){
        $n = $n|pow(2,26);
    }
    if($g1 == "초자연적 현상"||$g1=="포스트 아포칼립스픽션"||$g1=="재난 영화"||$g1=="괴수 영화"||$g1=="Survival film"){
        $n = $n|pow(2,27);
    }
    if($g1 == "정치 스릴러"||$g1=="정치 드라마"){
        $n = $n|pow(2,28);
    }
    if($g1 == "다큐드라마"||$g1=="범죄 다큐멘터리"||$g1=="Nature documentary"||$g1=="성장 스토리"||$g1 == "다큐멘터리"){
        $n = $n|pow(2,29);
    }
    if($g1 == "법정드라마"){
        $n = $n|pow(2,30);
    }



    if($g2=="액션 영화"||$g2=="액션"||$g2=="액션 스릴러"||$g2=="액션어드벤처"||$g2=="무협 영화"){
        $n = $n|pow(2,0);
    }
    if($g2 == "스릴러"||$g2=="액션 스릴러"||$g2=="심리스릴러"||$g2=="하이스트 영화"||$g2=="심리호러"||$g2=="슬래셔 영화"||$g2=="애로틱 스릴러"||$g2=="정치 스릴러"||$g2=="서스펜스"){
        $n = $n|pow(2,1);
    }
    if($g2 =="드라마"||$g2=="역사 드라마"||$g2=="코미디 드라마"||$g2=="음악 드라마"||$g2=="버디 영화"||$g2=="멜로드라마"||$g2=="정치 드라마"||$g2=="다큐드라마"||$g2=="법정드라마"||$g2=="성장 스토리"||$g2=="전기"||$g2=="Survival film"){
        $n = $n|pow(2,2);
    }
    if($g2 == "전쟁 영화"){
        $n = $n|pow(2,3);
    }
    if($g2 == "첩보영화"){
        $n = $n|pow(2,4);
    }
    if($g2 == "모험 영화"||$g2=="액션어드벤처"||$g2=="Survival film"){
        $n = $n|pow(2,5);
    }
    if($g2 == "역사"||$g2=="서사 영화"||$g2=="역사허구물"||$g2=="역사 드라마"||$g2=="시대물"||$g2=="역사 로맨스"||$g2=="사극"||$g2=="무협 영화"){
        $n = $n|pow(2,6);
    }
    if($g2 == "서부극"||$g2=="스파게티 웨스턴"){
        $n = $n|pow(2,7);
    }
    if($g2 == "판타지 영화"||$g2=="판타지"){
        $n = $n|pow(2,8);
    }
    if($g2 == "풍자"||$g2=="풍습희극"||$g2=="풍속소설"){
        $n = $n|pow(2,9);
    }
    if($g2 == "코미디 영화"||$g2=="코미디 드라마"||$g2=="코미디"||$g2=="뮤지컬 코미디"||$g2=="로맨틱 코미디"||$g2=="블랙 코미디"||$g2=="풍습희극"||$g2=="호러 코미디"||$g2=="뮤지컬 코미디"||$g2=="패러디"||$g2=="희극"||$g2=="스크루볼 코미디"){
        $n = $n|pow(2,10);
    }
    if($g2 == "로맨스"||$g2=="로맨틱 코미디"||$g2=="멜로/로맨스"||$g2=="연애 소설"||$g2=="역사 로맨스"){
        $n = $n|pow(2,11);
    }
    if($g2 == "가족 영화"||$g2=="가족"){
        $n = $n|pow(2,12);
    }
    if($g2 == "음악 드라마"||$g2=="음악 장르"||$g2=="음악"||$g2=="콘서트 영화"){
        $n = $n|pow(2,13);
    }
    if($g2 == "뮤지컬 코미디"||$g2=="백스테이지 뮤지컬"||$g2=="뮤지컬 코미디"){
        $n = $n|pow(2,14);
    }
    if($g2 == "범죄 영화"||$g2=="하이스트 영화"||$g2=="범죄물"||$g2=="슬래셔 영화"||$g2=="스플래터 영화"||$g2=="범죄 다큐멘터리"||$g2=="추리물"||$g2=="범죄"){
        $n = $n|pow(2,15);
    }
    if($g2 ==  "미스터리 영화"||$g2=="미스터리"||$g2=="심리호러"||$g2=="추리물"){
        $n = $n|pow(2,16);
    }
    if($g2 == "멜로드라마"||$g2=="멜로드라마"||$g2=="멜로/로맨스"||$g2=="멜로드라마"){
        $n = $n|pow(2,17);
    }
    if($g2 == "애니매이션"||$g2=="일본의 애니메이션"||$g2 == "애니메이션"){
        $n = $n|pow(2,18);
    }
    if($g2 == "SF 영화"||$g2=="공상 과학"||$g2=="포스트 아포칼립스픽션"||$g2=="픽션"||$g2=="스팀펑크"){
        $n = $n|pow(2,19);
    }
    if($g2 == "종교 영화"||$g2=="알레고리"){
        $n = $n|pow(2,20);
    }
    if($g2 == "공포 영화"||$g2=="호러 코미디"||$g2=="심리호러"||$g2=="슬래셔 영화"||$g2=="스플래터 영화"||$g2=="괴수 영화"||$g2=="심리호러"||$g2=="공포(호러)"){
        $n = $n|pow(2,21);
    }
    if($g2 == "댄스영화"){
        $n = $n|pow(2,22);
    }
    if($g2 == "슈퍼히어로영화"){
        $n = $n|pow(2,23);
    }
    if($g2 == "스포츠"){
        $n = $n|pow(2,24);
    }
    if($g2 == "에로티카"||$g2=="에로틱 스틸러"||$g2=="애로틱 스릴러"){
        $n = $n|pow(2,25);
    }
    if($g2 == "필름 누아르"){
        $n = $n|pow(2,26);
    }
    if($g2 == "초자연적 현상"||$g2=="포스트 아포칼립스픽션"||$g2=="재난 영화"||$g2=="괴수 영화"||$g2=="Survival film"){
        $n = $n|pow(2,27);
    }
    if($g2 == "정치 스릴러"||$g2=="정치 드라마"){
        $n = $n|pow(2,28);
    }
    if($g2 == "다큐드라마"||$g2=="범죄 다큐멘터리"||$g2=="Nature documentary"||$g2=="성장 스토리"||$g2 == "다큐멘터리"){
        $n = $n|pow(2,29);
    }
    if($g2 == "법정드라마"){
        $n = $n|pow(2,30);
    }


    return $n;

}

function genreNum1($g1){
    $n=0;
    if($g1=="액션 영화"||$g1=="액션"||$g1=="액션 스릴러"||$g1=="액션어드벤처"||$g1=="무협 영화"){
        $n = $n|pow(2,0);
    }
    if($g1 == "스릴러"||$g1=="액션 스릴러"||$g1=="심리스릴러"||$g1=="하이스트 영화"||$g1=="심리호러"||$g1=="슬래셔 영화"||$g1=="애로틱 스릴러"||$g1=="정치 스릴러"||$g1=="서스펜스"){
        $n = $n|pow(2,1);
    }
    if($g1 =="드라마"||$g1=="역사 드라마"||$g1=="코미디 드라마"||$g1=="음악 드라마"||$g1=="버디 영화"||$g1=="멜로드라마"||$g1=="정치 드라마"||$g1=="다큐드라마"||$g1=="법정드라마"||$g1=="성장 스토리"||$g1=="전기"||$g1=="Survival film"){
        $n = $n|pow(2,2);
    }
    if($g1 == "전쟁 영화"){
        $n = $n|pow(2,3);
    }
    if($g1 == "첩보영화"){
        $n = $n|pow(2,4);
    }
    if($g1 == "모험 영화"||$g1=="액션어드벤처"||$g1=="Survival film"){
        $n = $n|pow(2,5);
    }
    if($g1 == "역사"||$g1=="서사 영화"||$g1=="역사허구물"||$g1=="역사 드라마"||$g1=="시대물"||$g1=="역사 로맨스"||$g1=="사극"||$g1=="무협 영화"){
        $n = $n|pow(2,6);
    }
    if($g1 == "서부극"||$g1=="스파게티 웨스턴"){
        $n = $n|pow(2,7);
    }
    if($g1 == "판타지 영화"||$g1=="판타지"){
        $n = $n|pow(2,8);
    }
    if($g1 == "풍자"||$g1=="풍습희극"||$g1=="풍속소설"){
        $n = $n|pow(2,9);
    }
    if($g1 == "코미디 영화"||$g1=="코미디 드라마"||$g1=="코미디"||$g1=="뮤지컬 코미디"||$g1=="로맨틱 코미디"||$g1=="블랙 코미디"||$g1=="풍습희극"||$g1=="호러 코미디"||$g1=="뮤지컬 코미디"||$g1=="패러디"||$g1=="희극"||$g1=="스크루볼 코미디"){
        $n = $n|pow(2,10);
    }
    if($g1 == "로맨스"||$g1=="로맨틱 코미디"||$g1=="멜로/로맨스"||$g1=="연애 소설"||$g1=="역사 로맨스"){
        $n = $n|pow(2,11);
    }
    if($g1 == "가족 영화"||$g1=="가족"){
        $n = $n|pow(2,12);
    }
    if($g1 == "음악 드라마"||$g1=="음악 장르"||$g1=="음악"||$g1=="콘서트 영화"){
        $n = $n|pow(2,13);
    }
    if($g1 == "뮤지컬 코미디"||$g1=="백스테이지 뮤지컬"||$g1=="뮤지컬 코미디"){
        $n = $n|pow(2,14);
    }
    if($g1 == "범죄 영화"||$g1=="하이스트 영화"||$g1=="범죄물"||$g1=="슬래셔 영화"||$g1=="스플래터 영화"||$g1=="범죄 다큐멘터리"||$g1=="추리물"||$g1=="범죄"){
        $n = $n|pow(2,15);
    }
    if($g1 ==  "미스터리 영화"||$g1=="미스터리"||$g1=="심리호러"||$g1=="추리물"){
        $n = $n|pow(2,16);
    }
    if($g1 == "멜로드라마"||$g1=="멜로드라마"||$g1=="멜로/로맨스"||$g1=="멜로드라마"){
        $n = $n|pow(2,17);
    }
    if($g1 == "애니매이션"||$g1=="일본의 애니메이션"||$g1 == "애니메이션"){
        $n = $n|pow(2,18);
    }
    if($g1 == "SF 영화"||$g1=="공상 과학"||$g1=="포스트 아포칼립스픽션"||$g1=="픽션"||$g1=="스팀펑크"){
        $n = $n|pow(2,19);
    }
    if($g1 == "종교 영화"||$g1 =="알레고리"){
        $n = $n|pow(2,20);
    }
    if($g1 == "공포 영화"||$g1=="호러 코미디"||$g1=="심리호러"||$g1=="슬래셔 영화"||$g1=="스플래터 영화"||$g1=="괴수 영화"||$g1=="심리호러"||$g1=="공포(호러)"){
        $n = $n|pow(2,21);
    }
    if($g1 == "댄스영화"){
        $n = $n|pow(2,22);
    }
    if($g1 == "슈퍼히어로영화"){
        $n = $n|pow(2,23);
    }
    if($g1 == "스포츠"){
        $n = $n|pow(2,24);
    }
    if($g1 == "에로티카"||$g1=="에로틱 스틸러"||$g1=="애로틱 스릴러"){
        $n = $n|pow(2,25);
    }
    if($g1 == "필름 누아르"){
        $n = $n|pow(2,26);
    }
    if($g1 == "초자연적 현상"||$g1=="포스트 아포칼립스픽션"||$g1=="재난 영화"||$g1=="괴수 영화"||$g1=="Survival film"){
        $n = $n|pow(2,27);
    }
    if($g1 == "정치 스릴러"||$g1=="정치 드라마"){
        $n = $n|pow(2,28);
    }
    if($g1 == "다큐드라마"||$g1=="범죄 다큐멘터리"||$g1=="Nature documentary"||$g1=="성장 스토리"||$g1 == "다큐멘터리"){
        $n = $n|pow(2,29);
    }
    if($g1 == "법정드라마"){
        $n = $n|pow(2,30);
    }

    return $n;

}

$servername = "localhost"; 
$username = "root";
$password = "ghks2122"; 
$database = "inp"; 

    $conn =mysqli_connect($servername,$username,$password,$database); 

    if(!$conn){
        die("Connection failed:". mysqli_connect_error());
    }
    for($i=1 ; $i<=1781 ; $i++){    
        $query="SELECT * FROM inp_movie WHERE id = $i"; 
        $result=mysqli_query($conn,$query);
        $row = mysqli_fetch_array($result); 
        
        $g1 = $row[genre1];
        $g2 = $row[genre2];
        $g3 = $row[genre3];
        $g4 = $row[genre4];
        $g5 = $row[genre5];

        if($g2 == NULL){
            $genreNum = genreNum1($g1);

        }
        else if($g3 == NULL){
            $genreNum = genreNum2($g1,$g2);
        }
        else if($g4 == NULL){
            $genreNum = genreNum3($g1,$g2,$g3);
        }
        else if($g5 == NULL){
            $genreNum = genreNum4($g1,$g2,$g3,$g4);
        }
        else{
            $genreNum = genreNum5($g1,$g2,$g3,$g4,$g5);
        }
        

        $sql ="UPDATE inp_movie SET genreNum = '$genreNum' WHERE id = $i ";
        $r = mysqli_query($conn,$sql);

    

        if($r){ 
            echo "New record created successfully.<br>"; 
        } else{
            echo "Error: ".$sql."<br>".mysqli_error($conn)."<br>";
    }
    }



mysqli_close($conn);



?>